{"comment_text": "Just a few years after being diagnosed bipolar and still new to the game, on a trek to find the right &quot;cocktail&quot; of medicines to keep me both sane and happy, I used Abilify for about a month to contain my mania without &quot;snowing&quot; myself intolerably.<p>It did snow me, it made me depressed, in addition to not working while at work (or socializing at all) I would either leave work or hide in a conference room.<p>Normally the thing to do obviously is discontinue the drug and try another, but it&#x27;s during these states, at least for me, that one loses focus, self-perception and the nerve and inclination to resolve the situation.<p>Your doctor might argue that what you&#x27;re feeling is actually normal, what everyone else feels, and you just feel lousy because you&#x27;re not manic as you had delightfully been before. Just give it three weeks, he says.<p>Maybe he&#x27;s right, maybe he&#x27;s not; maybe he doesn&#x27;t want to deal with trying a different drug at least for a few more weeks to get you to calibrate to the one you don&#x27;t like. But he&#x27;s got an advantage in that debate which is that you are chemically subdued. Challenge him and put up a fair fight before letting yourself become convinced one way or the other. You might reach a compromise that works better, like sticking with the drug but at a lower dose.<p>Eventually my shrink put that together and we subbed in another atypical antipsychotic, Zyprexa, which, though like Abilify good for some people and bad for others, and risky, gets the job done, along others in the cocktail, nicely for me.<p>So when starting a drug, especially a neuroleptic or an antimanic, try to remember to be aggressive in monitoring yourself and be vocal when articulating what you think are your negative side effects stemming from the new drug. Don&#x27;t just show up to your next session and say you&#x27;re doing fine when you&#x27;re not, even though a depressive spell makes that a tempting thing to do.<p>And for the rookies, in addition to the above, if you find yourself reluctant to complain about any new drug that has a sexual side effect like impotency or no libido, for God&#x27;s sake, snap out of that and tell your doctor, otherwise you will not only not resolve those problems but you risk conditioning yourself to distrust medicine and psychiatry which can lead to noncompliance and possibly your downfall.<p>It takes some time, but if you&#x27;re motivated and smart about it, you&#x27;ve got a good shot at rescuing your captured soul from manic depression, and without killing your soul, or yourself, in the process.", "author": "d0ugie", "title": null, "url": null, "timestamp": 1431277845, "created_at": "2015-05-10T17:10:45.000Z", "comment_id": "9520544", "parent_id": 9520039, "story_title": "Dodging Abilify", "story_id": 9520039, "story_url": "http://wp.rxisk.org/dodging-abilify/", "points": null}