{"comment_text": "You don&#x27;t cite a source for your claim that serial rapists are rare, and the available data tends to contradict it: <a href=\"https:&#x2F;&#x2F;yesmeansyesblog.wordpress.com&#x2F;2009&#x2F;11&#x2F;24&#x2F;predator-redux&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;yesmeansyesblog.wordpress.com&#x2F;2009&#x2F;11&#x2F;24&#x2F;predator-re...</a><p>From that link, which discusses psychologist David Lisak&#x27;s studies of rapists: &quot;The last time I discussed Lisak’s work, I focused on the proportion of the population are the serial predators: a limited group within the population who are recidivist rapists, and who account for the overwhelming majority of rapes, and for a large portion of the child abuse and molestation and the intimate partner violence.&quot;<p>Do you have studies to cite that back up the opposite claim? It&#x27;s perfectly possible the reality is unclear, but everything I&#x27;ve read about the issue supports the idea that the majority of rapes are commited by significantly than 10% of the male population.<p>This suggests a view in which rape is seen as a &quot;predator&#x2F;citizen&quot; problem rather than a &quot;men&#x2F;women&quot; problem, given that male rapists are about as rare as false rape reports (FBI data suggests that 8% of all rape reports are false, and Lisak and other&#x27;s work suggests that about 8% of men are rapists, with as few as 4% accounting for 75-80% of rapes).<p>As well as having the potential to open up new ways of addressing rape (and maybe identifying serial rapists early) this change in perspective would allow a more equal focus on male victims, whose numbers are not well-known (male under-reporting rates are almost completely unstudied and plausibly higher than women&#x27;s).", "author": "tjradcliffe", "title": null, "url": null, "timestamp": 1431289293, "created_at": "2015-05-10T20:21:33.000Z", "comment_id": "9521169", "parent_id": 9520553, "story_title": "Despite DNA, the Rapist Got Away", "story_id": 9520272, "story_url": "http://www.nytimes.com/2015/05/10/opinion/sunday/nicholas-kristof-despite-dna-the-rapist-got-away.html", "points": null}