{"comment_text": "&gt; Have you felt this, and how to achieve your goals or master something without giving up?<p>Personally I have functional goals when I&#x27;m interested in an activity. Learn C++? Okay, how do I write a program that will draw a box to the screen? Now how do I shade it? How do I do that with less overhead....<p>I give myself six months for tasks like that, often it takes considerably less time. Sometimes a matter of days or weeks. Very occasionally I run into a &#x27;To make an apple pie, first create the universe.&#x27; style problem and it takes significantly longer in those cases. But at least then I&#x27;ve got a basis to compare how hard the problem is to, and can cache out the steps that need to be taken. Worst comes to the worst I get to the end of the six months and assign new schedules based on how large the problem stack has grown.<p>If you think of it like a constraint for a problem: You&#x27;re starting off and your constraint is &#x27;Best in the world&#x27; and that&#x27;s a very narrow target to hit. But if you start the other side of things, &#x27;my constraint is to draw a circle&#x27; , &#x27;now it&#x27;s to shade it&#x27; &#x27;Now it&#x27;s to give the circle a nose&#x27; ... then it&#x27;s a lot harder to fail, especially if you&#x27;re generous with your time in those sorts of activities.<p>You&#x27;re starting off with constraints that are at the edge of your current skills that way, rather than constraints that are... not feasible to reach that quickly.<p>Even then, I would warn against a desire to be the best in the world: There are seven billion people in the world. If you define your success along some particular line as being the best, you are comparing yourself to someone who got all the genetic breaks, started when they were a kid, and finds the subject rewarding enough to work on it more or less continuously.<p>Chances are really bad that you&#x27;re the best in the world at anything. Like 7 billion to 1 against. Even worse, the sacrifices demanded of people who are truly the best in the world in terms of some particular activity often seem to leave time for anything resembling a life. And for what? The returns on being the best in the world are rarely in line with the effort it takes to be so, or at least so it seems.<p>^_^<p>tl&#x2F;dr: Small steps, consistently applied.", "author": "6d0debc071", "title": null, "url": null, "timestamp": 1431289256, "created_at": "2015-05-10T20:20:56.000Z", "comment_id": "9521165", "parent_id": 9520205, "story_title": "Ask HN: I am giving up early on things I want to achieve.What is the way forward?", "story_id": 9520205, "story_url": "", "points": null}