{"comment_text": "This article serves as a pretty clear cut example of the pejorative &quot;hipsterism&quot;. She&#x27;s essentially rejecting the very culture she identified with previously solely because of its perceived higher degree of popularity in metro areas.<p>She also has a wrong headed idea about metropolitan areas in general and about San Francisco specifically. These are not cities that have inherently normalized counter-culture, raising a generation of conformist non-conformists. They are centers of migration. The overwhelming majority of the population is not from San Francisco or even from California.<p>The reason you don&#x27;t see many counter culture types amongst adults in the suburbs is because, by the very nature of conformity, it&#x27;s difficult to get a job and making a living as an outsider. So as you grow up, you either conform or you move somewhere where there are like minded individuals. San Francisco didn&#x27;t create counter culture...the counter culture moved there and created San Francisco.<p>She didn&#x27;t move to S.F. and find out city kids are posers. She moved there and found 1,000&#x27;s who moved there from the suburbs just like her. Confronted with the cognitive dissonance of discovering that she&#x27;s not a unique snowflake and, in her own way, is just as conformist as &quot;mainstream&quot;, she decided to declare herself &quot;authentic&quot; and every one else a poser.<p>She was counter culture _before_ it was cool. For real.<p><i>edit</i><p>I&#x27;ve seen this sort of reaction so many times it deserves its own logical fallacy.<p>The True Scotsman Fallacy.<p>The True Scotsman Fallacy is the assertion that oneself, or one&#x27;s inner group, is the only true representation of a particular culture, viewpoint, or interest group. All other groups are rejected for various, seemingly arbitrarily selected, criteria.", "author": "jkyle", "title": null, "url": null, "timestamp": 1431279442, "created_at": "2015-05-10T17:37:22.000Z", "comment_id": "9520631", "parent_id": 9519975, "story_title": "The Counterculture Is Better in the Suburbs", "story_id": 9519975, "story_url": "http://www.triggerwarning.us/the-counterculture-is-better-in-the-suburbs/", "points": null}