{"comment_text": "Good point about the reasons of productivity leaps. Funnily enough, I recall that one of the main selling points of Java was portability (the famous &quot;Write Once Run Everywhere&quot;), even though C was already supposed to be portable; but the environment wasn&#x27;t, and you still had to develop OS-specific code.<p>Anyway, yes I agree the ecosystem is key. This is why a lot of new languages are either running on the JVM (like Clojure and Scala) or are interoperable with C (like Rust and Nim). In other cases, languages have managed to create an entire ecosystem very rapidly (Node.js and Javascript in general, Ruby and others).<p>&gt; The thing is that with modern hardware, even toy software projects are quite usable<p>You&#x27;re right. I must admit I&#x27;m not a big fan of this &quot;throw more at the problem&quot; approach, and I wonder for how long this approach will work. After all, Moore&#x27;s law is slowing down, as the unit cost per transistor has stopped decreasing after 28nm.<p>&gt; but this isn&#x27;t the case with hardware design.<p>Yes, for one because if you design hardware that is sub-optimal, in other words that requires more transistors, that translates into higher costs, and lower margins. That&#x27;s some powerful incentive IMO. Not to mention that if the hardware is not powerful enough, the toy software projects that you mention will have trouble running ^^<p>Therefore I think a central question is the loss of performance compared to the gain in productivity. A naive translation of C to assembly leads to disastrous performance. For years (decades?) people had to resort to assembly for speed-critical routines, and you can still find assembly in video decoders for instance. But the productivity is so much higher than the loss of performance is acceptable.", "author": "MootWoop", "title": null, "url": null, "timestamp": 1431274572, "created_at": "2015-05-10T16:16:12.000Z", "comment_id": "9520330", "parent_id": 9519864, "story_title": "CλaSH – From Haskell to Hardware", "story_id": 9516217, "story_url": "http://www.clash-lang.org/", "points": null}