{"comment_text": "In short Oracle is an Enterprise sales agency focusing on Enterprise clients, not the average implementations for companies less than $1B in revenue (my best guess).  I know some companies smaller use it, but it isn&#x27;t common to see it in smaller Enterprises.<p>In general through the 90&#x27;s and even up until the last 5 years or so, telling your Enterprise C suite that you were installing Oracle was the equivalent of selecting IBM back in the day.  There was a saying that *&quot;no one ever got fired for going with IBM&quot;, when it comes to Databases, ERP&#x2F;Financial software etc Oracle was in a similar boat.  Oracle is also a sales agency that happens to make software, and they are damn good at sales.  They typically lock companies in for long periods of time and get paid handsomely for it.<p>Oracle is also like an infestation, they get in and start spreading as much as possible.  I honestly can&#x27;t blame them, I&#x27;d do the same in their shoes trying to sell more product&#x2F;services, but my issue with them is they have projects that drag on and on and so many fail to ever do 20% of what was promised.  They aren&#x27;t alone in that realm, and companies bare some of the blame too, but by far I see more Oracle solutions fail to get implemented than almost any other.<p>As for if their products are worth it, I will say their Database is really a solid product and has some really nice capabilities.  I personally would never choose it or any product they push, but that isn&#x27;t a judgement on its capabilities.  In fact, I admire that they created the RAC cluster and how it is architected etc.  Not that they are perfect, but at the time RAC was introduced it was truly a unique way to package and solve some common problems for Enterprises.  For my money though, I&#x27;ll bet on PostgreSQL or other solutions before I ever use&#x2F;recommend Oracle.", "author": "davismwfl", "title": null, "url": null, "timestamp": 1431290507, "created_at": "2015-05-10T20:41:47.000Z", "comment_id": "9521220", "parent_id": 9519416, "story_title": "Ask HN: Who uses Oracle and why?", "story_id": 9519416, "story_url": "", "points": null}