{"comment_text": "All servers since 2003 had the IE Enhanced Security mode. It actually has nothing directly to do with Zones.<p>Zones were MSFT&#x27;s vision from the early 2000&#x27;s in which your internet access will be divided between internal corporate resources, trusted parties preferably trough some sort of AD federation (anyone remembers when MSFT tried to make global AD federation over the internet with Andromeda or w&#x2F;e it was called?) and the internet. Each zone would have a different security setup which will restrict what kind of information you can pass to a site (e.g. your NTLM&#x2F;Kerberos credentials) and what kind of actions the site can perform on your browsers.\nIt wasn&#x27;t a bad idea, the market just never went there and even corporate resources today are accessed via the global internet and not in the intranet or some sort of a federated network.<p>MSFT has always had some weird things, some were way a head of it&#x27;s time and like many things which are a head of their time when they miss they miss by a mile. Heck every Windows machine connected to the internet still has (or can have i think in Windows 8 it&#x27;s not enabled by default any more but i could be wrong) a globally translated name trough PNRP akin to DNS, I&#x27;ve actually used it during the early Vista days for remote access when DyDNS services were still in their infancy and not many trustworthy services were out there.\nPNRP was also quite a neat idea (especially once they&#x27;ve dropped the IPv6 requirement from it) in which all Windows machines publish their own unique name via DHT&#x27;s these names can be signed and the address is then quite hard to spoof (ala ToR hidden services), but i doubt that even 5% of Windows power users know about it, and probably less than 5% of those who do use it.", "author": "dogma1138", "title": null, "url": null, "timestamp": 1431275774, "created_at": "2015-05-10T16:36:14.000Z", "comment_id": "9520404", "parent_id": 9520218, "story_title": "Microsoft nixes ActiveX add-on technology in new Edge browser", "story_id": 9519853, "story_url": "http://www.computerworld.com/article/2920892/web-browsers/microsoft-nixes-activex-add-on-technology-in-new-edge-browser.html", "points": null}