{"comment_text": "&gt; JBoss is NOT old-school and big honking (whatever that<p>&gt; means). The download size of JBoss is about 110MB, and it<p>&gt; starts in about a second. 10 seconds with an app that<p>&gt; contains hundreds to thousands of beans.<p>&gt;<p>&gt; Compare that to a typical Spring app, where the downloaded<p>&gt; size of all things you need easily exceeds 200MB and the war<p>&gt; itself is a 100MB or so. A war for Java EE is often some 1 to<p>&gt; 2MB for a BIG application. Go figure.<p>I tried to steer clear of precise numbers, because they tend to change every couple of years... and you can easily date your knowledge by citing them.<p>However, spin up a new Spring application today (there&#x27;s an online project generator wizard at <a href=\"http:&#x2F;&#x2F;start.spring.io\" rel=\"nofollow\">http:&#x2F;&#x2F;start.spring.io</a>).  Make it a web app, with Hibernate&#x2F;JPA and the PostgreSQL database driver, and Spring Actuator for automated metrics.  Build this generated app.  The resulting executable JAR with all dependencies will weigh 24 megs, and that <i>includes</i> its app server.<p>Ditch the Hibernate&#x2F;JPA, and use PostgreSQL with Spring JDBC instead (which is often superior to an ORM anyway).  Your total deliverable size drops to 13 megs.<p>Look, it&#x27;s all Java at the end of the day.  Spring plays nice with JEE components, and in practice it&#x27;s not necessarily such an either&#x2F;or matter.  The Java community has a sliding spectrum of bleeding-edge early adopters (e.g. Scala, Akka, Play)... conservative late-adopters (e.g. JEE)... and pragmatic moderates in between (e.g. Spring).  If your comfort zone is on a different spot in the spectrum, or if you disagree with how someone else defines the spectrum, then by all means do your own thing.  But the comment to which I replied said that, &quot;<i>There&#x27;s very little reason to use Spring today</i>&quot;.  That, frankly, is nonsense.", "author": "StevePerkins", "title": null, "url": null, "timestamp": 1431280524, "created_at": "2015-05-10T17:55:24.000Z", "comment_id": "9520708", "parent_id": 9520061, "story_title": "A Java EE Startup: Filtering information with zeef.com", "story_id": 9519575, "story_url": "http://www.adam-bien.com/roller/abien/entry/a_java_ee_startup_filtering", "points": null}