{"comment_text": "I wish people would just behave the way they want and allow everyone else to do the same (as long as no one is being hurt).<p>I&#x27;ve often thought that extreme liberals and extreme conservatives are far more similar to each other than they are to those in the middle.  Both groups have a system of fixed, rigid beliefs.  Their mind has been made up on an issue before you even begin discussing the topic, and the use of logic and reason fails spectacularly on them.  The only difference between them all is that they just happened to be born into different environments, so their particular beliefs are mere manifestations of chance.<p>I&#x27;ll ask my friends occasionally, &quot;Why you believe that?&quot;, and I&#x27;m amazed when I realize that beyond a few brief soundbites, there&#x27;s no real foundation beneath their viewpoints.  Strong emotions but little rationale.<p>And the problem is that these same people always want to enforce their way of thinking on everyone else.  I just don&#x27;t know why.  I&#x27;m unsure about almost all of my beliefs -- there&#x27;s so many variables and so much data behind most of these subject that I&#x27;m perplexed about how <i>anyone</i> can be so certain they&#x27;re right.<p>Quick tip for identifying people like this: if you are debating with someone and they quickly become emotional, angry, or start using a variety of logical fallacies (<a href=\"http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_fallacies\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_fallacies</a>), then you&#x27;re dealing with someone whose beliefs have no substance.  The rules apply both ways though; this tip applies only if you didn&#x27;t provoke them somehow.  (For instance, I can become angry in a debate when someone starts attacking my character rather than my position.)", "author": "Xcelerate", "title": null, "url": null, "timestamp": 1431275296, "created_at": "2015-05-10T16:28:16.000Z", "comment_id": "9520375", "parent_id": 9519975, "story_title": "The Counterculture Is Better in the Suburbs", "story_id": 9519975, "story_url": "http://www.triggerwarning.us/the-counterculture-is-better-in-the-suburbs/", "points": null}