{"comment_text": "&gt; Another thing to keep in mind is that most rape and sexual assault is committed by people whom the victim knows personally, which makes the majority of cases much simpler to prosecute than this one.<p>That&#x27;s actually <i>more</i> difficult to prosecute successfully. It&#x27;s much easier when you have DNA evidence linking two people who otherwise have no connection whatsoever, and demonstrating that forcible sexual contact occurred despite the rapist claiming to be somewhere else at the time.<p>It&#x27;s much <i>more</i> difficult when the rapist is a relative who has plenty of opportunities to be close to the victim, plenty of alternative alibis or excuses, and (most importantly) plenty of leverage to emotionally blackmail the victim into not filing charges.<p>Rape can occur within marriage or domestic partnerships, and this is probably by far the most difficult to prosecute. The fact that the victim knows the rapist makes it <i>more</i> complicated legally and logistically, not less. In an abusive relationship, it&#x27;s considered a success just to get the victim out of the relationship at all, and if they&#x27;re in an emotional state where they can still move on and function in life, that&#x27;s an added bonus. In situations like these, trying to prosecute the rapist is a distant pipe dream.<p>&gt; Yet another thing to keep in mind is that although rapists tend to be repeat offenders, only a small percentage are &quot;serial rapists&quot;. That is, they&#x27;re rare like serial killers are. Those guys barely exist.<p>I really don&#x27;t understand where you draw the line between &quot;repeat offender&quot; and &quot;serial rapist&quot;. If you look at the link I cited in the original comment, it provides data on the number of repeat offenders, which is already troubling enough to be of concern, regardless of whether it meets your unstated threshold of &quot;serial rapist&quot;.", "author": "chimeracoder", "title": null, "url": null, "timestamp": 1431279358, "created_at": "2015-05-10T17:35:58.000Z", "comment_id": "9520627", "parent_id": 9520553, "story_title": "Despite DNA, the Rapist Got Away", "story_id": 9520272, "story_url": "http://www.nytimes.com/2015/05/10/opinion/sunday/nicholas-kristof-despite-dna-the-rapist-got-away.html", "points": null}