{"comment_text": "&gt; try UK, which is pretty keen on immigrants<p>Not sure why you believe this. The UK is very unfriendly towards immigrants since the new government formed in 2010 and abolished the tier 1 highly skilled migrant visa.<p>This means there&#x27;s no longer a route for highly skilled non-EEA migrants to work for themselves unless they are considerably well off (1m GBP+) <i>and</i> want to play entrepreneur, or they&#x27;re already the top of their game and qualify for an &#x27;exceptional talent&#x27; visa (which is almost nobody).<p>If you want to work in the UK as a non-EEA person you have to go the tier 2 route and find a sponsor for 5 years. For those 5 years you will NOT be allowed to start your own business on the side. It&#x27;s debatable if you can even do freelance work on the side. Your sponsor may take advantage of the fact that switching jobs is very difficult and expensive for you.<p>After 5 years, you can apply for ILR and work for yourself, although there&#x27;s no guarantee you will get it even if you follow all the rules because the rules can change [1] in those 5 years as the UK grows more anti-immigrant!<p>I really don&#x27;t understand what kind of talent they expect to attract -- the idea of having my hands tied behind my back for 5 years at the peak of my life is an absolute deal breaker for me. They might attract very young people, but for highly-skilled people in their late 20s and older the UK is simply not a very appealing option anymore. Furthermore, if you had 1m GBP lying around you&#x27;d be better off buying e.g. Maltese citizenship and having access to the whole of the EU instantly.<p>Australia is one of a handful of countries that still has sensible highly-skilled migrant policies, but anti-immigration sentiment is rising there too.<p>[1] <a href=\"http:&#x2F;&#x2F;www.timeshighereducation.co.uk&#x2F;news&#x2F;visa-refusal-for-china-expert-miwa-hirono-is-pure-madness&#x2F;2019182.article\" rel=\"nofollow\">http:&#x2F;&#x2F;www.timeshighereducation.co.uk&#x2F;news&#x2F;visa-refusal-for-...</a>", "author": "ryanjshaw", "title": null, "url": null, "timestamp": 1431285213, "created_at": "2015-05-10T19:13:33.000Z", "comment_id": "9520982", "parent_id": 9520532, "story_title": "Ask HN: If I were your dream hire, would hire me? I live in Somalia", "story_id": 9520328, "story_url": "", "points": null}