{"comment_text": "&gt; anyone remembers when MSFT tried to make global AD federation over the internet with Andromeda or w&#x2F;e it was called?<p><i>Microsoft Marvel</i>, the Cairo directory service - see Bill Gates (former internal) 1994 memo: &quot;Windows: The Next Killer Application on the Internet&quot;: <a href=\"http:&#x2F;&#x2F;www.microsoft.com&#x2F;about&#x2F;companyinformation&#x2F;timeline&#x2F;timeline&#x2F;docs&#x2F;di_killerapp_InternetMemo.rtf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.microsoft.com&#x2F;about&#x2F;companyinformation&#x2F;timeline&#x2F;t...</a><p><i>&quot;The existing Domain Name System is becomes quickly eclipsed by the Cairo directory service; providing universal resource location services without the need for specialized, arcane applications like archie. Users of the SMTP mail infrastructure take advantage of the advanced features of EMS while remaining backward compatible with their current Internet messaging solutions. Distributed information on the Internet is indexed by Cario and browsed using the Explorer across thousands of information servers worldwide without the need of tools like WAIS and Mosaic. Windows becomes the global infostructure explorer.<p>The hottest content server on the Internet? Microsoft Marvel. It’s already integrated with all of these services and has a huge content base and commercial vendor support. Perhaps most importantly, Marvel solves the difficult electronic commerce problem well ahead of the Internet: the ability to securely purchase goods in a networked environment. Cairo becomes the clear platform choice for new information providers, offering the most flexibility in both management and technology. OLE Windows applications are now Internet-enabled - people schedule meetings across the Internet and share ideas using Microsoft application products on Windows. No more specialized tools, no more need for Unix to carry the infostructure. Access to the Internet is a natural extension of the base Windows system as well as Microsoft applications.&quot;</i>", "author": "frik", "title": null, "url": null, "timestamp": 1431276268, "created_at": "2015-05-10T16:44:28.000Z", "comment_id": "9520438", "parent_id": 9520404, "story_title": "Microsoft nixes ActiveX add-on technology in new Edge browser", "story_id": 9519853, "story_url": "http://www.computerworld.com/article/2920892/web-browsers/microsoft-nixes-activex-add-on-technology-in-new-edge-browser.html", "points": null}