{"comment_text": "&gt; But I also see no fundamental difference to say a planned economy<p>Unfortunately from Arrow&#x27;s impossibility theorem (linked above), there is no objectively &quot;best&quot; ranking for allocating resources so all plans will be sub optimal (provided values are subjective). Because of this, any system&#x2F;allocation will always produce winners and losers, the only difference being who they are.<p>In a planned economy you can prevent those products from being made entirely or at least kept to a minimum but again, who decides the trade off. Subjective morality is always an issue. Democracy, btw,  is based on a principle of subjective morality, if a majority of voters feel that their plastic toy is more important than an endangered fish then isn&#x27;t that the way it should be? If not, why not? Of course, the real issue is that people have a hard time predicting the consequences of their decisions. (see <a href=\"http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Futarchy\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Futarchy</a> for a possible fix).<p>-----<p>As far as the means of production go, I&#x27;d like to set aside the moral argument (for now) and just talk about incentives. A country (with any political structure you choose) has a natural gold source somewhere in an area, they don&#x27;t know exactly where.<p>0. Who predicts a market for gold and how are they incentivised?<p>1. Who searches for the mine and how are they incentivised?<p>2. Who develops the mine and how are they incentivised?<p>3. Who discovers and researches new mining tech and how are they incentivised?<p>4. Who organises and hires miners, craftsmen, support and how are they incentivised?<p>5. Who pays these employees and other operating costs and how are they incentivised?<p>6. Who markets, ships, advertises the finished gold and how are they incentivised?<p>And the big question, what if the venture fails? does everyone above get paid? If any loans are taken to start this venture and can&#x27;t be paid back who takes the liability?<p>It is not that I don&#x27;t believe there isn&#x27;t an alternative but capitalism, as a system, has answers to all of these questions and the list isn&#x27;t exhaustive by any means. Any upgrade&#x2F;fix&#x2F;replacement should have answers to questions like this before it can be seriously considered.<p>edit: formatting", "author": "grinnbearit", "title": null, "url": null, "timestamp": 1431274851, "created_at": "2015-05-10T16:20:51.000Z", "comment_id": "9520347", "parent_id": 9519793, "story_title": "Capitalism and Slavery", "story_id": 9506478, "story_url": "http://www.thenation.com/blog/206025/capitalism-and-slavery", "points": null}