{"comment_text": "Questions:\n- what kind of career do you want? \n- What specific job market are you currently in? \n- You mention the pay is great but dislike the work. How much time can you dedicate on projects you&#x27;re curious&#x2F;passionate and capable of doing?<p>Regarding unhappiness at work, I was in your situation some years ago and found that the solution to my problem was putting in the required hours at work and then going home and working really really hard on the things that mattered to me. Also I found that having a daily exercise routine helped a lot with my productivity and mood!<p>Regarding leaving your country, I&#x27;d start by marketing yourself better. Your site doesn&#x27;t give specifics on what your ambitions are and does not showcase why I&#x27;d want to hire you. Perhaps, if you SHOWED me what projects you can do for me, I&#x27;d be more inclined to see where you&#x27;d fit in my organization. A great example of good marketing was this kid&#x27;s portfolio that sprung some weeks ago: <a href=\"http:&#x2F;&#x2F;www.hostmeinca.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.hostmeinca.com&#x2F;</a><p>Another way to leave is by getting a masters in another country. Look for masters in a field you&#x27;re curious about and then search for scholarships. There are tons of scholarship resources out there (google Fullbright, Daad, Gates Millennium Scholarships, UK council scholarships). A masters is also a great way to network and meet potential employers or even future coworkers that might end up giving you a recommendation down the line!<p>Some other advice (and I know the HN crowd will probably differ):\n- GET ON LINKEDIN! Get people you&#x27;ve worked with to endorse you!\n- go read this book by John Somnez called Softskills. It will help you market yourself better as a developer <a href=\"http:&#x2F;&#x2F;simpleprogrammer.com&#x2F;softskills\" rel=\"nofollow\">http:&#x2F;&#x2F;simpleprogrammer.com&#x2F;softskills</a><p>Hope this helps!", "author": "hauget", "title": null, "url": null, "timestamp": 1431278444, "created_at": "2015-05-10T17:20:44.000Z", "comment_id": "9520576", "parent_id": 9520328, "story_title": "Ask HN: If I were your dream hire, would hire me? I live in Somalia", "story_id": 9520328, "story_url": "", "points": null}