{"comment_text": "You absolutely, 100% should not start a company. Most startups fail, and the ones that succeed are often not the first venture by an entrepreneur. So if you think you&#x27;ll get some validation by succeeding at starting a company, you have a far better chance of feeling even worse when you fail.<p>It also sounds like you&#x27;re pretty young. The massive success stories, like Facebook and Microsoft, are often started by young people, but the vast majority of successful startups are starting by older founders. I believe the average age of a successful founder is 38.<p>One of the reasons for that is that you learn so much and meet so many people early in your career. When you start a company without working for a few years, you&#x27;re starting with a disadvantage: you&#x27;re missing a lot of important experience that you can get from working for someone else, especially if that someone else is committed to mentoring you.<p>If you keep seeing articles like &quot;some young guy, similar to you, makes $100M selling some product you could have built&quot;, stop reading the news. Those aren&#x27;t the norm, and there are often circumstances involved that you could never replicate. You don&#x27;t need to be Mark Zuckerberg to be wildly successful and important, and you shouldn&#x27;t even peg your self esteem to something like that.<p>Keep in mind that nothing is stopping you from creating side projects, throwing them on Product Hunt, HN, and Reddit, and seeing what happens. With all the tools available now, most proofs of concept can be completed in a weekend. In fact, one small test of whether you&#x27;re ready to be an entrepreneur is whether you can execute some products over the weekend. If you have the passion and motivation to give up your weekend, and you can get something done that quickly and dirtily, you have at least one pre-requisite of building a startup.<p>Here are the conditions under which you should start a company, if you ever find yourself in them:<p>1. You can lose $50k+ and still be fine. You <i>will</i> spend an enormous amount of your own money, and you almost certainly will never get it back. Startups are a black hole for both time and money.<p>2. You can sacrifice most of the nice things in your life, including expensive food, vacations, nice cars, and quite a bit of your social life.<p>3a. If B2C: you are one of a small group of people capable of solving a common problem, and you also have the time and connections to access investors.<p>3b. If B2B: you are one of a small group of people capable of accessing your market. This often comes from having worked in a particular industries for years. (The market should always come first, not the idea. Be ready to throw away many ideas to get to the right one.)<p>4. You are very comfortable with failure, and you don&#x27;t cringe when going over your failures with a fine-toothed comb in order to learn everything you possibly can and not repeat your mistakes.", "author": "smt88", "title": null, "url": null, "timestamp": 1431286948, "created_at": "2015-05-10T19:42:28.000Z", "comment_id": "9521074", "parent_id": 9520966, "story_title": "Ask HN: Are my motivations for getting into entrepreneurship superficial?", "story_id": 9520966, "story_url": "", "points": null}