{"comment_text": "They did the same thing with the Wen Ho Lee case. The government engaged in malfeasance which led a bunch of people to take the completely opposite position, which is that any investigation of him was unwarranted. Then you read the facts of the case and it&#x27;s really obvious that yes an _investigation_, at least, was warranted. Also like the Lee case, you have people blaming this on racial profiling, when from the facts you can tell the trigger for the investigation was obviously because of the combination of access and behavior, which can be a consequence of your naturalized citizen status. People, like the coworker in the article complaining about the password access not being suspicious if Chen was white, have a really hard time contextualizing that access was used in conjunction with expropriating data to a foreign government official. It&#x27;s idiotic and needs to be pointed out.<p>Speaking of possible double agent, Wen Ho Lee&#x27;s wife was a spy for the CIA, and one of the accusations against Lee was when he was in China with his wife, while she was at a conference and apparently &quot;working&quot;. And there&#x27;s some evidence that one of the people that Lee was in communication with sending NOFORN documents to, Lee mistakenly thought was working for Taiwan, not China. I have never given up thinking it&#x27;s possible something else was going on there and the government may have known more than it could reveal in court to secure a prosecution. But if you read contemporary media accounts, Lee&#x27;s case has been completely whitewashed of any suspicious behavior that rightfully should have flagged an investigation whether or not it turns out he was actually guilty of anything.", "author": "A_COMPUTER", "title": null, "url": null, "timestamp": 1431289576, "created_at": "2015-05-10T20:26:16.000Z", "comment_id": "9521181", "parent_id": 9520344, "story_title": "Accused of Spying for China, Until She Wasn’t", "story_id": 9518826, "story_url": "http://www.nytimes.com/2015/05/10/business/accused-of-spying-for-china-until-she-wasnt.html", "points": null}