{"comment_text": "Let me try to answer it. I&#x27;m sure that I won&#x27;t change your mind, but when I published Anvil (a similar library for Java) - I got lots of questions like yours.<p>- XMLs are not type safe, I can type any tag name in there, and I can set almost any value to my attributes - AAPT won&#x27;t even notice (yes, Android Studio is much smarter these days, it may give a warning, but it won&#x27;t be a compiler warning, so it won&#x27;t be in your automated build logs. You will also miss it when using other text editor or IDE). I can put a view inside another view (not a viewgroup) - and it will pass as well. Since we waste CPU time on XMLs preprocessing - it would be nice if they also warned us about our errors at this stage, not crashes in runtime.<p>- The file hierarchy is terrible. All XMLs must be in the same folder, no nested folders. Having a large project makes you have dozens of XMLs on the same layer of hierarchy. Since we have OS with directories - it would be nice to use that feature like we use it for java packages.<p>- There are some styles, but they are too limited comparing to, say, CSS. If one ever tried LESS or SASS - he will love the mixing, variables, calculated expressions etc. It&#x27;s fast to write, it&#x27;s easy to read, it&#x27;s reusable. You don&#x27;t have to jump around multiple closely related files to tie it all together in your head. You have them in one place. Since XMLs are processed - it would be nice if I could write something like &quot;android:background=darken(@color&#x2F;mycolor, 30%)&quot;<p>- There is some responsiveness, but it&#x27;s too limited. If you have 3 nested views, and the topmost has margin in landscape and no margin in portrait - you have to have two (almost identical) files. Or three, if you want to use merge&#x2F;include. In fact now they are all in different folders, despite they are very closely related!<p>- There is no way to merge with unique ids (child layout will have the duplicated ids when included twice).<p>- There is no mixins or macros. If I have layout with textview+button pairs - I will end up copying those two tags everywhere. If I have macros - I would write it once, and then would only type `&lt;TextViewWithButton text=&quot;foo&quot; buttonText=&quot;bar&quot;&gt;` - that is supposed to be expaded into &lt;TextView ...&#x2F;&gt;&lt;Button ....&#x2F;&gt; with some texview and button attributes substituded to the given actual values.<p>- There is no data binding.", "author": "zserge", "title": null, "url": null, "timestamp": 1431276464, "created_at": "2015-05-10T16:47:44.000Z", "comment_id": "9520450", "parent_id": 9520298, "story_title": "Anko – Pleasant Android development in Kotlin", "story_id": 9519787, "story_url": "https://github.com/JetBrains/anko", "points": null}