{"comment_text": "This is actually a common feeling. You need only watch SLC Punk which addresses this issue.<p>I really became aware of anti-sheep-sheep in college. I had a pretty tame outside appearance. My hair was short. I shaved. I dressed in a way that was affordable in the town south western I grew up in (Old Navy, maybe some music tshirts from Hot Topic). Ironically I actually hung out with some real counterculture people (by the definition of this article) growing up. They accepted me although I didn&#x27;t always dress like them. There was no way to dress like them because there was no one style.<p>My first summer job in college was working with a group that was basically a group of liberal hippies from the east coast, and I don&#x27;t mean that in an insulting sense. We did backpacking and trail work for an americorps program. I initially didn&#x27;t get the job, but my girlfriend did. When someone dropped out of the program I joined.<p>Immediately I stuck out like a sore thumb. These people weren&#x27;t even close to being accepting of any ideas other than their own. They were conformists. I didn&#x27;t have the right hair, it wasn&#x27;t long enough. I didn&#x27;t wear the right brand of shoes, Chacos were required. I didn&#x27;t even drink the right kind of water because I refilled a cheap gatorade bottle rather than use a Nalgene. Even the things I did that happened fit in with the group were questioned. During our first team party I mentioned how much I liked &quot;The Doors&quot;, and I someone had the balls to say I didn&#x27;t look like I would like that kind of music.<p>I ate the wrong food because I wasn&#x27;t vegan. The chain smokers told me: &quot;don&#x27;t you know the crap you&#x27;re putting into your body?&quot;.<p>After 3 months of backpacking and working in national parks my appearance was quite a bit scruffier. The head of the program actually had the balls to say &quot;I looked like a team member now&quot;.<p>I began to value people who had their own ideas, regardless of whether those ideas were or weren&#x27;t mainstream. I&#x27;d rather see new culture than counter-culture. I&#x27;m suspicious of people who define themselves by being the disagreeing with mainstream because to me that seems just as restrictive as conforming.<p>It&#x27;s extremely rare to find anyone who&#x27;s not looking to be validated by their peers.", "author": "shanemhansen", "title": null, "url": null, "timestamp": 1431274534, "created_at": "2015-05-10T16:15:34.000Z", "comment_id": "9520326", "parent_id": 9519975, "story_title": "The Counterculture Is Better in the Suburbs", "story_id": 9519975, "story_url": "http://www.triggerwarning.us/the-counterculture-is-better-in-the-suburbs/", "points": null}