{"comment_text": "&gt; &quot;You go to commit some code to a public repo. The maintainer scolds you for using merges instead of fast forwards.&quot;<p>Imagine you clone a repo. So your version is identical. You now add a couple more commits to master. Now, to make them identical again, all you have to do is upload the new commits, and then get his master branch to update to point to the latest one. Makes sense, right? That&#x27;s a fast-forward.<p>Instead, what you do is merge your latest commit with the older commit two back, which creates a third commit with <i>identical content to the previous one</i>. That&#x27;s silly, right? That&#x27;s why fast-forward instead of merge.<p>&gt; &quot;You decide to bring in some more code from the public repo. Here is a 6000 word essay on what rebase means.&quot;<p>Rebase is when you take the content from a chain of commits, and make a completely new chain with that same content, just because it makes it look neater. You then change the branch from pointing at the head of the old chain to pointing at the head of the new. That&#x27;s all it does. The old chain is still there until it&#x27;s garbage collected a few weeks later (or you tag it to stop it disappearing).<p>&gt; &quot;You try to look at an old version of the code. Suddenly you are in ‘detached HEAD’ state. The End.&quot;<p>I&#x27;m not sure what the fear is here, so I&#x27;m not sure what to tell you. Create a test repository with a few commits and change the hashes below for real ones:<p><pre><code>    git checkout master # on master, whew\n    git checkout e34a53 # oh no, detached head\n    git checkout master # it&#x27;s ok, back on master, whew\n    git checkout 343a34 # oh no, detached head\n    git checkout master # it&#x27;s ok, back on master, whew\n    git checkout fe34ee # oh no, detached head\n    git checkout master # it&#x27;s ok, back on master, whew\n    git checkout a567ed # oh no, detached head\n    git checkout master # it&#x27;s ok, back on master, whew\n</code></pre>\nRepeat until you&#x27;re not panicking? :-)", "author": "phaemon", "title": null, "url": null, "timestamp": 1431283313, "created_at": "2015-05-10T18:41:53.000Z", "comment_id": "9520873", "parent_id": 9520670, "story_title": "Git in six hundred words", "story_id": 9520145, "story_url": "http://maryrosecook.com/blog/post/git-in-six-hundred-words", "points": null}