{"comment_text": "&gt; How can you know the information is harmful to you if you don&#x27;t click on it?<p>It&#x27;s not your job to determine if it&#x27;s harmful to you; it&#x27;s not your job to determine if it&#x27;s harmful to national security.  That&#x27;s someone else&#x27;s job, he did it, and now others have ignored that determination and have released it anyway.<p>&gt;  Rules, if they exist, preventing government employees from reading leaked documents are the actual harm.<p>Do you deny the legitimacy of state secrets altogether?  When you go into a salary negotiation, do you say, &#x27;I&#x27;d be willing to make as little as $X&#x27;?<p>If you accept that it&#x27;s possible for secrets to be legitimate, then you have to accept that there will be secrets you will not be able to personally examine for their legitimacy (because revealing them to you would make them…no longer secret).<p>Likewise, it&#x27;s not appropriate for someone in a position of great trust to betray that trust and decide for himself to leak something.  One does not put the security of 350 million souls at risk due to the determination of a single man.<p>Instead, there are procedures in place for those with access to secrets to challenge their classification; there are people whose job ratings improve if they are able to sustain such challenges.  The right thing to do, if someone believes something is misclassified, is to follow those procedures and shepherd that case through that system of people.<p>To do otherwise would be like having a single man with his finger on a nuclear weapon.  Sure, he might only unleash it appropriately, but he might not.  We have a system for the release of weapons; we have systems in place for the release of information.", "author": "wtbob", "title": null, "url": null, "timestamp": 1431286300, "created_at": "2015-05-10T19:31:40.000Z", "comment_id": "9521042", "parent_id": 9520993, "story_title": "SKYNET: Applying Advanced Cloud-Based Behavior Analytics [pdf]", "story_id": 9520295, "story_url": "http://cryptome.org/2015/05/nsa-skynet-intercept-15-0507.pdf", "points": null}