{"comment_text": "Wasn&#x27;t saying it&#x27;s a bad thing, but the enterprise market, especially in finance is bloated with various ActiveX components because it was the flavor of the week (turned into the falvor of the decade) when companies had to transform legacy thick client applications to web applications, the sad part is that by the time everything was in place ActiveX was already legacy :)\nHeck I&#x27;ve had to review ActiveX builds are recent as last year which were &quot;brand new&quot;.<p>I personally loath ActiveX, i hate pretty much any tech that require me to load a 3rd party app inside my browsers whether it&#x27;s the pesky JRE which you can never update because the 1 site you need it \nfor won&#x27;t support anything past JRE 7.1, or that ancient ActiveX which you need to open in IE10 in IE7 compatibility mode with virtually every security measure disabled.\nI&#x27;m just saying this move might hurt quite a bit of people, but MSFT seems to be moving away from their usual desktop software modus operandai and moving towards becoming more and more of a services providers&#x2F;SAAS company.<p>It doesn&#x27;t mean that if they decide to take out ActiveX it won&#x27;t hurt allot of people, and even MSFT in the short time, luckily they still will have some sort of backwards compatibility support and i hope it will be available to normal consumers on demand also. Since sorry but once in a while i need to use an ActiveX too, whether it&#x27;s some old WebEx or Citrix installation or some really outdated SSL VPN and i don&#x27;t want to keep some Windows XP&#x2F;7 VM on hand all the time to do it.<p>I know it&#x27;s not what the cool kids do, but sadly for people that tend to work with big and sometimes anachronistic enterprises it&#x27;s a reality.", "author": "dogma1138", "title": null, "url": null, "timestamp": 1431275120, "created_at": "2015-05-10T16:25:20.000Z", "comment_id": "9520367", "parent_id": 9519932, "story_title": "Microsoft nixes ActiveX add-on technology in new Edge browser", "story_id": 9519853, "story_url": "http://www.computerworld.com/article/2920892/web-browsers/microsoft-nixes-activex-add-on-technology-in-new-edge-browser.html", "points": null}