{"comment_text": "&gt; The idea that things that are popular are &quot;solving a problem&quot; is a really bad trend in my opinion.<p>Ohh, I think the opposite.  Admittedly the &quot;problem&quot; solved by some popular solutions is &quot;novelty&quot; but they tend to rise and fall swiftly (poster child: Secret).<p>&gt; I doubt highly that the millions of snapchat users at some point said &quot;If only there were a service that deleted my pictures 10 seconds after I took them.&quot;<p>Well actually Snapchat <i>does</i> solve a real problem.  encoderer put it well in comment <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9517657\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9517657</a> :<p>&gt; Snapchat is the teenagers answer to the question many millennials have fretted about -- &quot;how will ppl born today deal with having all 18 years of their development online&quot;. The answer is: they don&#x27;t put it online.<p>I made this mistake underestimating YouTube: it seemed like any other video site and I figured anyone who wanted to host video could just put it on their own web site -- I am interested in stuff by topic, not medium, and isn&#x27;t everyone like me?  But in fact YouTube solved several hard problem: 1 - hosting and bandwidth, even for people who didn&#x27;t want to make a site (they were undifferentiated from other sites in this way, but the need was and is there); 2 - they dealt with infringements&#x2F;DCMA restrospectively rather than prospectively which meant they could move faster at lower cost and 3 - they were first&#x2F;early at embedding, so you could use video on your site without implementing a lot of crud.  Those were all real needs.<p>There is a completely unrelated problem which is: if you don&#x27;t have a monetization approach early on, it&#x27;s hard \nto graft one on later.  And using my Youtube example: it&#x27;s my understanding they&#x27;ve never made a profit.  But in aggregate their costs are lower (by riding on google&#x27;s infrastructure, expertise and scale) and add other values to their parent company.<p>It&#x27;s hard but not impossible to see that most of these Unicorns could provide value to an acquirer in excess of the acquisition cost.  It&#x27;s possible Uber has enough revenue base to make it worthwhile for (say) Daimler-Benz to buy them at a non-terrible multiple.  It&#x27;s harder to say the same for airBNB.", "author": "gumby", "title": null, "url": null, "timestamp": 1431280739, "created_at": "2015-05-10T17:58:59.000Z", "comment_id": "9520728", "parent_id": 9518081, "story_title": "How to Build a Unicorn and Walk Away with Nothing", "story_id": 9516910, "story_url": "http://heidiroizen.tumblr.com/post/118473647305/", "points": null}