{"comment_text": "&gt; I don&#x27;t think either deterrance nor rehabilitation, the traditional justifications for criminal punishment, really work.<p>I agree that <i>punishment</i> most probably does not end up in rehabilitation. And I think that should be obvious to everyone, locking up people in unsafe areas, where others too are ill in mind, where most are folks who&#x27;ve had poor lives and poor fortunes, it only reinforces the wrong ideals and norms. The Scandinavian model of rehabilitation probably works better: putting people in safe homes with counselors who show love instead of hate, and a general treatment of dignity (one that they were not shown before -- indeed almost all violent criminals come from broken homes, almost all criminals never had a positive and loving authority figure to show them the way). Why not break the cycle and treat them with respect?<p>&gt; I don&#x27;t think that justification is as important when we&#x27;re talking about what&#x27;s essentially a commercial crime. It doesn&#x27;t even implicate personal safety in the same way as say burglary.<p>I don&#x27;t like that distinction of violent crimes and non-violent crimes, it&#x27;s too easy, it makes it seem like the non-violent crimes are not bad enough. You know how michaelochurch used to equate managers who gave references to attempted murder or something to that effect? That was of course silly, but I can actually kind of appreciate the logic in that... in today&#x27;s society these actions essentially make or break a person&#x27;s life. Not in terms of life and death, but it makes the difference of a life of dignity and work to possible homelessness and a complete inability to provide for your family. And further down in this continuum, there&#x27;s financial crimes, there&#x27;s the SV crimes (inculcating bullshit ideas by way of crafty advertising, . These actions don&#x27;t cause immediate physical harm, but overtime they rot lives of so many in an insidiously disgusting way.", "author": "pen2l", "title": null, "url": null, "timestamp": 1431282512, "created_at": "2015-05-10T18:28:32.000Z", "comment_id": "9520828", "parent_id": 9520503, "story_title": "Where’s The Beef?", "story_id": 9519106, "story_url": "http://fivethirtyeight.com/features/wheres-the-beef/", "points": null}