{"comment_text": "There are a lot of people in this thread who are taking about the morality of killing a character while not understanding how death is framed in the game. Things that happen when you die:<p>You need to WP (way point). It costs a negligible amount for most player and is instantaneous (sans load times). In towns, like in this case, it&#x27;s free. They cover all maps, and are normal two minutes or so walk apart from each other. In the videos, the character would literally have been alive and where he was in less than a second at no cost.<p>If you&#x27;re in combat when you die, you&#x27;re armor will slowly break (after numerous deaths one piece eventually will). This is free to fix and not a difficult NPC to find. Aside, falling to your death when not in combat will not cause this effect.<p>Another point to bring up is that players are falling to their death nonstop everywhere. The game has hidden areas, &quot;jumping puzzles&quot; and generally encourages players to make risky jumps just for the fun of it. Seeing a player fall and die, even in the middle of a town, would go fully unnoticed unless maybe by a few who might resurrect the player on a whim.<p>Finally, I didn&#x27;t see anything of real in game value on that account and the player only had one other low level character. I&#x27;m guessing they purchased it during the resent 75% off sale with the sole intent of hacking. Further, it was probably an alt account that the person was expecting to get banned eventually.<p>In other words, the videos doesn&#x27;t really show in game value being destroyed or lasting damage being done as punitive cruelty. Rather, it&#x27;s a just a funny twist on the normally mundane task of banning. This scares no reasonable player and, rather, actually is reassuring to know they&#x27;re dealing with hackers.", "author": "matxip", "title": null, "url": null, "timestamp": 1431277103, "created_at": "2015-05-10T16:58:23.000Z", "comment_id": "9520487", "parent_id": 9518920, "story_title": "Video game execution watched by 325K players", "story_id": 9518920, "story_url": "http://www.theguardian.com/technology/2015/may/08/video-game-execution-guild-wars-2-arena-net", "points": null}